examples/sockets/OpenFOAM/OpenFOAM-3.0.1/cpl-socket/tests/stressC-P/debug/test_forces_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }

    //streamwiseIn
    //{
    //    type            fixedValue; 
    //    value           uniform (0);
    //}

    //streamwiseOut
    //{
    //    type            fixedValue; 
    //    value           uniform (0);
    //}
    
    streamwiseIn
    {
        type            cyclic; 
        neighbourPatch  streamwiseOut;
    }

    streamwiseOut
    {
        type            cyclic; 
        neighbourPatch  streamwiseIn;
    }

    CPLReceiveMD 
    {
        type            zeroGradient;
    }

    front
    {
        type            cyclic;
        neighbourPatch  back;
    }

    back 
    {
        type            cyclic;
        neighbourPatch  front;
    }

}

// ************************************************************************* //
